# 2. 파이썬

## 2.3 파이썬 데이터 다루기: 팬더스의 기초

In [1]:
import pandas as pd

In [3]:
data = pd.Series([10, 20, 30, 40, 50], index = ['a', 'b', 'c', 'd', 'e'])
print(data)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
print(data['c'])

30

In [5]:
df = pd.DataFrame({
    'Name': ["Kim", "Sophie", "Sara", "Cyrus", "Lee", "James", "Daniel"],
    'Age': [28, 24, 35, 32, 48, 27, 34],
    'City': ["Seoul", "Paris", "Berlin", "London", "Busan", "NewYork", "Seattle"],
    'Sex': ["Man", "Woman", "Woman", "Man", "Man", "Man", "Man"],
    'Continent': ["Asia", "Europe", "Europe", "Europe", "Asia", "America", "America"]})
df

     Name  Age     City    Sex Continent
0     Kim   28    Seoul    Man      Asia
1  Sophie   24    Paris  Woman    Europe
2    Sara   35   Berlin  Woman    Europe
3   Cyrus   32   London    Man    Europe
4     Lee   48    Busan    Man      Asia
5   James   27  NewYork    Man   America
6  Daniel   34  Seattle    Man   America

In [6]:
df.head(2)

     Name  Age   City    Sex Continent
0     Kim   28  Seoul    Man      Asia
1  Sophie   24  Paris  Woman    Europe

In [7]:
df['City']

0      Seoul
1      Paris
2     Berlin
3     London
4      Busan
5    NewYork
6    Seattle
Name: City, dtype: object

In [8]:
df.loc[3] ## 행 인덱스 번호를 사용한 행 추출

Name          Cyrus
Age              32
City         London
Sex             Man
Continent    Europe
Name: 3, dtype: object

In [9]:
df.loc[2, 'City'] ## 행 인덱스 번호와 열 이름을 사용한 데이터 추출

'Berlin'

In [10]:
## 첫 번째부터 두 번째 행, 두 번째 열부터 세 번째 열까지의 데이터프레임 슬라이싱
df.loc[0:2, 'Age':'City']

   Age    City
0   28   Seoul
1   24   Paris
2   35  Berlin

In [11]:
df.iloc[0] ## 정수형 인덱스로 특정 행 추출하기

Name           Kim
Age             28
City         Seoul
Sex            Man
Continent     Asia
Name: 0, dtype: object

In [12]:
df.iloc[0, 1] ## 첫 번째 행과 두 번째 열의 데이터 추출

np.int64(28)

In [13]:
## 첫 번째부터 두 번째 행, 두 번째 열부터 세 번째 열까지의 데이터프레임 슬라이싱
df.iloc[0:2, 1:3]

   Age   City
0   28  Seoul
1   24  Paris

In [14]:
df[df['Age'] > 30] ## Age가 30보다 큰 데이터 필터링

     Name  Age     City    Sex Continent
2    Sara   35   Berlin  Woman    Europe
3   Cyrus   32   London    Man    Europe
4     Lee   48    Busan    Man      Asia
6  Daniel   34  Seattle    Man   America

In [15]:
df[(df['Age'] < 30) & (df['City'] == "Seoul")] ## 두 가지 조건을 사용한 데이터 필터링

  Name  Age   City  Sex Continent
0  Kim   28  Seoul  Man      Asia

In [16]:
df.loc[7] = ['Kofi', 55, 'Cape Town', 'Man', None]
df

     Name  Age       City    Sex Continent
0     Kim   28      Seoul    Man      Asia
1  Sophie   24      Paris  Woman    Europe
2    Sara   35     Berlin  Woman    Europe
3   Cyrus   32     London    Man    Europe
4     Lee   48      Busan    Man      Asia
5   James   27    NewYork    Man   America
6  Daniel   34    Seattle    Man   America
7    Kofi   55  Cape Town    Man      None

In [17]:
df.sort_values(by = 'Age', ascending = False)

     Name  Age       City    Sex Continent
7    Kofi   55  Cape Town    Man      None
4     Lee   48      Busan    Man      Asia
2    Sara   35     Berlin  Woman    Europe
6  Daniel   34    Seattle    Man   America
3   Cyrus   32     London    Man    Europe
0     Kim   28      Seoul    Man      Asia
5   James   27    NewYork    Man   America
1  Sophie   24      Paris  Woman    Europe

In [18]:
df.groupby('Continent')['Name'].count()

Continent
America    2
Asia       2
Europe     3
Name: Name, dtype: int64

In [19]:
df.groupby('Continent').agg({'Age' : "mean", 'Name' : "count"})

                 Age  Name
Continent
America    30.500000     2
Asia       38.000000     2
Europe     30.333333     3